---
kind: property
id: P:Autodesk.Revit.DB.Visual.Speckle.TextureRealWorldOffsetZ
source: html/27aedd9d-91c5-e00d-9831-7fce2f34c095.htm
---
# Autodesk.Revit.DB.Visual.Speckle.TextureRealWorldOffsetZ Property

The property labeled "Offset Z" from the "Speckle" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetZ { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".